tap "sst/tap"
brew "claude-squad"
brew "doctl"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "python@3.13"
brew "git-filter-repo"
brew "go"
brew "iperf3"
brew "mas"
brew "mosh"
brew "node"
brew "nvm"
brew "openjdk"
brew "openjdk@17"
brew "pipx"
brew "ripgrep"
brew "tmux"
brew "uv"
brew "sst/tap/opencode"
cask "1password-cli"
cask "docker-desktop"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Craft", id: 1487937127
mas "Craft Web Clipper", id: 6748613311
mas "Flighty", id: 1358823008
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Photomator", id: 1444636541
mas "Screens 5", id: 1663047912
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Timery", id: 1425368544
