tap "sst/tap"
brew "stow"
brew "glibc"
brew "gcc"
brew "bat"
brew "ncurses"
brew "python@3.13"
brew "claude-squad"
brew "doctl"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "go"
brew "htop"
brew "jq"
brew "lazygit"
brew "iperf3"
brew "make"
brew "mosh"
brew "neovim"
brew "node"
brew "nvm"
brew "openjdk"
brew "pipx"
brew "perl"
brew "ripgrep"
brew "ruby"
brew "strace"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "tree"
brew "uv"
brew "xclip"
brew "yq"
brew "zoxide"
brew "zsh"
brew "sst/tap/opencode"