# macOS-only packages - GUI apps and Mac App Store items
# These are only installed on personal macOS machines

# macOS-specific CLI tools
brew "mas"  # Mac App Store CLI
brew "libusb"  # USB library

# Personal GUI applications (Casks)
cask "1password"
cask "1password-cli"
cask "beeper"
cask "chatgpt"
cask "claude"
cask "daisydisk"
cask "discord"
cask "ledger-live"
cask "lm-studio"
cask "anythingllm"
cask "notion"
cask "ollama-app"
cask "signal"
cask "spotify"
cask "synology-drive"
cask "tor-browser"
cask "trezor-suite"

# Development & Productivity GUI
cask "alt-tab"
cask "araxis-merge"
cask "arc"
cask "betterdisplay"
cask "bezel"
cask "descript"
cask "docker-desktop"
cask "figma"
cask "flux-app"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "handbrake-app"
cask "hazel"
cask "hey-desktop"
cask "hyperkey"
cask "ia-presenter"
cask "iina"
cask "imageoptim"
cask "jetbrains-toolbox"
cask "keyboard-maestro"
cask "little-snitch"
cask "macwhisper"
cask "monitorcontrol"
cask "obs"
cask "pdf-expert"
cask "raycast"
cask "readwise-ibooks"
cask "recut"
cask "screen-studio"
cask "send-to-kindle"
cask "setapp"
cask "sigmaos"
cask "soundsource"
cask "thebrowsercompany-dia"
cask "vlc"
cask "webstorm"
cask "xmind"
cask "yubico-authenticator"
cask "zoom"

# Mac App Store applications (personal)
mas "1Password for Safari", id: 1569813296
mas "Accelerate", id: 1459809092
mas "Actions", id: 1586435171
mas "Affinity Photo 2", id: 1616822987
mas "Amphetamine", id: 937984704
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Craft", id: 1487937127
mas "Craft Web Clipper", id: 6748613311
mas "Data Jar", id: 1453273600
mas "DaVinci Resolve", id: 571213070
mas "Dropover", id: 1355679052
mas "Fantastical", id: 975937182
mas "FileZilla Pro - FTP and Cloud", id: 1298486723
mas "Flighty", id: 1358823008
mas "Folder Preview", id: 6698876601
mas "Frame.io", id: 992958444
mas "Framous", id: 6636520519
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "Save to Reader", id: 1640236961
mas "Screens 5", id: 1663047912
mas "Slack", id: 803453959
mas "Tailscale", id: 1475387142
mas "Telegram", id: 747648890
mas "Teleprompter", id: 1533078079
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Timery", id: 1425368544
mas "Xcode", id: 497799835
mas "iA Writer", id: 775737590